app/controllers/posts_controller.rb

	def create
		@post = current_user.posts.build(post_params)
		@post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "sef"], ["body", "fse"], ["created_at", "2019-06-10 03:59:58.635211"], ["updated_at", "2019-06-10 03:59:58.635211"], ["user_id", 1]]